{
  "backend/main.mo": "Motoko actor implementing the backend for a workout tracking app, with per-user data stores for exercise templates and workout sessions, and CRUD operations for both.",
  "feature_evidence.json": "Feature evidence report linking the useQueries.ts history hook fix to test REQ-3, confirming high confidence that the hook correctly calls the backend and maps responses for WorkoutHistory and HistorySessionCard.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose, serving as a reference for build planning and component responsibilities across the app.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes including colors, borders, and sidebar tokens.",
  "frontend/index.html": "HTML entry point for the React app, mounting the root div and loading the main TypeScript module for the Track-A-Swole application.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes including login, exercise library, session creation, active workout, history, and session detail pages.",
  "frontend/src/components/AddExerciseForm.tsx": "Form component for adding a new exercise template with name, three default sets (weight/reps), and comments, using the useAddExercise mutation hook with validation and toast feedback.",
  "frontend/src/components/CompletedExerciseDisplay.tsx": "Read-only card component that displays a completed workout exercise with a set-by-set table of weight and reps, plus an optional comments section.",
  "frontend/src/components/ExerciseListItem.tsx": "List item component for an exercise template that supports inline editing of name and sets, and deletion with a confirmation dialog, using edit/delete mutation hooks.",
  "frontend/src/components/ExercisePicker.tsx": "A dropdown + button component that lets users select an exercise from their library and add it to a session, resetting the selection after each add.",
  "frontend/src/components/ExerciseTracker.tsx": "A collapsible card component for tracking sets (weight/reps) and comments for a single exercise during a workout session, with a visual indicator when data has been entered.",
  "frontend/src/components/HistorySessionCard.tsx": "A card component displaying a past workout session's name, date, and exercise count, navigating to the session detail page on click.",
  "frontend/src/components/Layout.tsx": "The main app layout component providing a sticky header, bottom navigation bar, and authentication guard that redirects unauthenticated users to the login page.",
  "frontend/src/components/SessionExerciseList.tsx": "A list component showing selected exercises for a session with up/down reorder buttons and a remove button for each exercise.",
  "frontend/src/components/SetInputRow.tsx": "A single row input component for entering weight and reps for one set, labeled with the set number.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an authenticated or anonymous ICP backend actor based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "A React context provider and hook for managing Internet Identity authentication, exposing login/logout functions, identity state, and login status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on exercises and workout sessions, including fetching, adding, editing, deleting exercises, and creating/completing workout sessions via a backend actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines light/dark mode CSS custom properties for the design system's color tokens.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ActiveWorkout.tsx": "Page component for an active workout session that restores/persists exercise data via localStorage, tracks sets per exercise, and submits the completed session to the backend.",
  "frontend/src/pages/CreateSession.tsx": "Page component for creating a new workout session, allowing the user to name the session, pick exercises from their library, reorder them, and navigate to the active workout page.",
  "frontend/src/pages/ExerciseLibrary.tsx": "Page component that displays the user's exercise templates in a list and provides a dialog for adding new exercise templates.",
  "frontend/src/pages/Home.tsx": "Landing page component that presents navigation cards linking to the Exercise Library, Create Session, Workout History, and other app sections.",
  "frontend/src/pages/Login.tsx": "Login page component that uses Internet Identity for authentication, redirecting to the home route on successful login. Displays a branded card UI with a sign-in button and loading state.",
  "frontend/src/pages/SessionDetail.tsx": "Page that fetches and displays a single workout session by ID, showing its exercises via CompletedExerciseDisplay with loading and not-found states.",
  "frontend/src/pages/WorkoutHistory.tsx": "Page that fetches and lists all past workout sessions using the useWorkoutHistory hook, rendering each via HistorySessionCard with loading, error, and empty states.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom oklch-based color tokens, border radius variables, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata for Track-A-Swole describing known issues (broken login persistence, empty history page, failed video upload) and pending fix requests for the workout history fetch and backend query logic."
}