{
  "backend/main.mo": "Motoko actor implementing the backend canister with per-user exercise library and workout session management, including CRUD operations for exercise templates and workout sessions with sorting/querying capabilities.",
  "feature_evidence.json": "Feature evidence report mapping three bug-fix features (perpetual loading spinner, non-functional Add Exercise button, and actor initialization audit) to their relevant frontend files and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON summary document describing the purpose and key implementation details of each frontend source file in the project.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom properties for the design system's color tokens in both light and dark themes.",
  "frontend/index.html": "Minimal HTML entry point for the React app titled 'Track-A-Swole' that mounts the app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes including home, login, exercise library, session creation, active workout, history, and session detail pages.",
  "frontend/src/components/AddExerciseForm.tsx": "Form component for adding a new exercise template with name, three default sets (weight/reps), and comments fields, using the useAddExercise mutation hook with validation and toast feedback.",
  "frontend/src/components/CompletedExerciseDisplay.tsx": "Read-only card component that displays a completed workout exercise's sets, weights, reps, and optional comments in a styled table layout.",
  "frontend/src/components/ExerciseListItem.tsx": "Renders a single exercise template list item with inline editing (name, sets, comments) and delete functionality, using mutation hooks and confirmation dialogs.",
  "frontend/src/components/ExercisePicker.tsx": "Dropdown selector component that lets users pick an exercise from their library and add it to a session via a callback.",
  "frontend/src/components/ExerciseTracker.tsx": "Collapsible card for tracking a single exercise during a workout, displaying set input rows and a comments textarea with visual indicators for entered data.",
  "frontend/src/components/HistorySessionCard.tsx": "Displays a summary card for a past workout session (name, date, exercise count) that navigates to the session detail page on click.",
  "frontend/src/components/Layout.tsx": "Root layout component providing the app shell with header, bottom navigation, authentication guard, and logout functionality using Internet Identity.",
  "frontend/src/components/SessionExerciseList.tsx": "Renders an ordered list of selected exercises for a session with up/down reordering and remove controls.",
  "frontend/src/components/SetInputRow.tsx": "Simple reusable row component with number inputs for weight and reps for a single set.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated (or anonymous) ICP backend actor using the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state and persisting identity via AuthClient from the DFINITY SDK.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on exercises and workout sessions, wrapping backend actor calls with caching and cache invalidation.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/ActiveWorkout.tsx": "Page component for an in-progress workout session that restores exercise data from localStorage or URL params, tracks sets per exercise, and submits the completed session to the backend.",
  "frontend/src/pages/CreateSession.tsx": "Page component for creating a new workout session, allowing the user to name the session, pick exercises from their library, and navigate to the active workout page.",
  "frontend/src/pages/ExerciseLibrary.tsx": "Page component that displays the user's exercise templates in a list with options to add new exercises via a dialog, handling loading and error states.",
  "frontend/src/pages/Home.tsx": "Landing page for Track-A-Swole app displaying navigation cards linking to Exercise Library, New Session, Workout History, and Progress sections with amber/orange gradient styling.",
  "frontend/src/pages/Login.tsx": "Login page that authenticates users via Internet Identity, redirecting to home on success, with a branded card UI and GeekDice footer.",
  "frontend/src/pages/SessionDetail.tsx": "Detail view for a single workout session fetched by ID, displaying session name, date, and a list of completed exercises using CompletedExerciseDisplay.",
  "frontend/src/pages/WorkoutHistory.tsx": "Page that fetches and lists all past workout sessions using useWorkoutHistory, showing loading, error, empty, and populated states via HistorySessionCard components.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, oklch-based design tokens, custom border radii, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing a known bug where the Exercise Library page shows a perpetual spinner and unresponsive Add Exercise button, with three existing fix-focused feature entries targeting actor initialization and query error surfacing in useQueries.ts."
}