{
  "kind": "build_request",
  "title": "Fix perpetual spinner and broken Add Exercise functionality on Manage Exercise page",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Investigate and fix the ExerciseLibrary page so it no longer shows a perpetual spinning orange loading indicator after a user logs in. The page should resolve its loading state and render the exercise list (or an empty state) once the backend query completes or errors.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8",
          "msg-10"
        ],
        "quotes": [
          "I click manage exercise, the page loads and there is a spinning orange wheel.",
          "the Manage Exercise page loads but shows a spinning orange wheel indefinitely"
        ]
      },
      "acceptanceCriteria": [
        "After logging in and navigating to the Exercise Library / Manage Exercise page, the loading spinner resolves within a reasonable time (< 10 seconds).",
        "If the backend call succeeds, the exercise list is displayed.",
        "If the backend call fails, an error message is shown instead of an infinite spinner."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Investigate and fix the 'Add Exercise' button on the Exercise Library page so it responds to user clicks and opens the Add Exercise dialog/form. The button must be functional after the user is authenticated.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8",
          "msg-10"
        ],
        "quotes": [
          "Any attempt to 'add exercise' and nothing happens."
        ]
      },
      "acceptanceCriteria": [
        "Clicking 'Add Exercise' while authenticated opens the AddExerciseForm dialog.",
        "Submitting the form with valid data successfully calls the backend and adds the exercise.",
        "The exercise list updates after a successful add without requiring a page reload."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Audit the useQueries.ts hooks related to exercise fetching and mutation (getExercises, addExercise, etc.) to ensure actor initialization is awaited correctly before making canister calls, and that query/mutation error states are properly surfaced rather than silently hanging.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "likely culprits are: A broken canister query/update call in the exercise management flow, A state initialization issue causing the loading spinner to never resolve"
        ]
      },
      "acceptanceCriteria": [
        "Exercise-related React Query hooks do not enter a permanent loading state when the actor is available.",
        "Any canister call error is caught and causes the query/mutation to transition to an error state.",
        "The actor is confirmed to be initialized before any canister call is attempted; if not yet ready, the query is disabled rather than hanging."
      ]
    }
  ],
  "constraints": [
    "Do not alter authentication logic in frontend/src/hooks/useInternetIdentity.ts or frontend/src/hooks/useActor.ts — these are read-only.",
    "Do not change unrelated pages or components; scope fixes to ExerciseLibrary.tsx, AddExerciseForm.tsx, and useQueries.ts."
  ],
  "nonGoals": [
    "Redesigning the Exercise Library UI or adding new features.",
    "Fixing or changing the goatbuff.png header image implementation.",
    "Changes to workout session creation or history pages."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}