{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Workout tracker app built on Internet Computer with Internet Identity login. Current issues include broken login/session persistence, failed video mascot upload (swoleAF.mp4), and History section not displaying completed workout sessions.",
  "architectural_notes": [
    "App is deployed on the Internet Computer platform using dfx CLI and canisters",
    "Internet Identity is used for authentication/login"
  ],
  "known_issues": [
    "History section does not display completed workout sessions",
    "Internet Identity login is broken - sessions do not persist",
    "Video mascot (swoleAF.mp4) could not be added to login page due to configuration error"
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-verify-that-the-usequeries-ts-history-hook-correctly-calls-the-backend-actor-method-passes-the-right-arguments-and-maps-the-response-into-the-shape-expected-by-workouthistory-and-historysessioncard-fix-any-mismatch-between-the-hook-s-return-type-and-what-the-components-consume",
      "title": "Verify that the useQueries.ts history hook correctly calls the backend actor method, passes the right arguments, and maps the response into the shape expected by WorkoutHistory and HistorySessionCard. Fix any mismatch between the hook's return type and what the components consume.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Diagnose and fix the WorkoutHistory page so that completed workout sessions are actually fetched from the backend and rendered. The page should display all past sessions via HistorySessionCard components, with proper loading, error, and empty states.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Verify that the backend getWorkoutHistory (or equivalent) query function correctly returns completed sessions for the calling Principal. If the backend stores sessions but the query returns an empty or incorrect result, fix the retrieval logic so sessions saved under the user's Principal are returned in reverse-chronological order.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "Track-A-Swole",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}