{
  "backend/main.mo": "Main Motoko actor implementing a multi-user workout tracking system with exercise library management (add, edit, delete templates with sets/reps), workout session creation and tracking, and workout history retrieval, using Principal-based user isolation and Map data structures.",
  "backend/migration.mo": "Migration module that transforms old single-user actor state (flat exercise and session maps) into new multi-user state (Principal-keyed nested maps), currently returning empty maps to reset state during migration.",
  "feature_evidence.json": "Feature evidence report documenting three authentication-related features: login page component, conditional Layout rendering for authenticated users, and logout button functionality.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files describing the React application structure, including routing, authentication, exercise management, workout tracking with localStorage persistence, and history viewing components.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark theme variables, featuring amber/orange accent colors and comprehensive design tokens for UI components.",
  "frontend/index.html": "HTML entry point for the Track-A-Swole application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "TanStack Router configuration defining all application routes including login, home, exercise library, session creation, active workout with exerciseIds search param validation, and workout history with detail views.",
  "frontend/src/components/AddExerciseForm.tsx": "Form component for creating exercise templates with name input, three sets of weight/reps inputs with validation, comments field, and explicit onClick handler on submit button to ensure proper form submission.",
  "frontend/src/components/CompletedExerciseDisplay.tsx": "Read-only card component displaying completed exercise details in a table format with set number, weight, reps, and optional comments section for workout history views.",
  "frontend/src/components/ExerciseListItem.tsx": "Displays a single exercise template with edit/delete functionality, allowing users to modify exercise name (backend limitation) and view/edit sets and comments with validation and toast notifications.",
  "frontend/src/components/ExercisePicker.tsx": "Dropdown selector component that displays available exercise templates from the library and allows users to add them to a workout session.",
  "frontend/src/components/ExerciseTracker.tsx": "Collapsible card component for tracking exercise performance during a workout, with inputs for weight/reps per set and a comments field.",
  "frontend/src/components/HistorySessionCard.tsx": "Displays a summary card for a completed workout session showing date, name, and exercise count, with navigation to detailed session view.",
  "frontend/src/components/Layout.tsx": "Main application layout with header, navigation bar, and authentication handling that redirects unauthenticated users to login and provides logout functionality.",
  "frontend/src/components/SessionExerciseList.tsx": "Displays a reorderable list of selected exercises for a workout session with controls to move exercises up/down and remove them.",
  "frontend/src/components/SetInputRow.tsx": "Simple input row component for entering weight and reps for a single set, with number validation and optional disabled state.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient configuration with support for delegation identity validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including exercise CRUD, workout session creation, exercise tracking, and history retrieval with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme color schemes, including primary amber/orange colors and chart color definitions.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/ActiveWorkout.tsx": "Manages active workout sessions with localStorage persistence, allowing users to track exercises with sets/reps/weight, restore interrupted sessions, and complete workouts.",
  "frontend/src/pages/CreateSession.tsx": "Provides UI for creating new workout sessions by naming them, selecting exercises from the library, reordering exercises, and navigating to the active workout page.",
  "frontend/src/pages/ExerciseLibrary.tsx": "Displays and manages the user's exercise template library with add/edit/delete capabilities through a dialog-based form interface.",
  "frontend/src/pages/Home.tsx": "Landing page component displaying welcome message and four navigation cards linking to exercise library, new session creation, workout history, and progress tracking features with amber/orange gradient styling.",
  "frontend/src/pages/Login.tsx": "Login page component that handles Internet Identity authentication, displays a branded card with sign-in button, and redirects to home page upon successful authentication.",
  "frontend/src/pages/SessionDetail.tsx": "Displays detailed view of a single workout session including name, date, and list of completed exercises with their set data, fetched by session ID from URL params.",
  "frontend/src/pages/WorkoutHistory.tsx": "Displays a list of all past workout sessions using HistorySessionCard components, with loading states, error handling, and empty state messaging.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, border radius variables, custom animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata and architectural documentation defining Track-A-Swole workout tracking app requirements, including exercise library with 3-set templates, session management, history viewing, and Internet Identity authentication integration."
}