{
  "backend/main.mo": "Main Motoko actor defining ExerciseTemplate (with id, name, sets array, comments), WorkoutSession, and WorkoutExercise types, plus CRUD operations for exercise templates and workout session management with migration support.",
  "backend/migration.mo": "Migration module that transforms old exercise format (id, name only) to new ExerciseTemplate format by adding default 3 sets with zero weight/reps and empty comments field.",
  "feature_evidence.json": "Feature evidence report documenting four features for updating AddExerciseForm, ExercisePicker, ExerciseTracker, and ExerciseListItem components to support exercise templates with 3 sets (weight/reps) and comments.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components and pages that handle exercise templates with set values, workout session creation, active workout tracking, and history display.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system configured for dark theme using amber/orange accent colors instead of typical blue/purple palette.",
  "frontend/index.html": "HTML entry point for the Track-A-Swole application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "TanStack Router configuration defining all application routes including home, exercise library, session creation, active workout (with exerciseIds search param), and workout history with session detail.",
  "frontend/src/components/AddExerciseForm.tsx": "Form component for creating exercise templates with name input, 3 sets with weight/reps number inputs, comments textarea, validation, and submission handling using useAddExercise mutation hook.",
  "frontend/src/components/CompletedExerciseDisplay.tsx": "Read-only card component displaying completed exercise details in a table format with set number, weight, reps columns, and optional comments section below.",
  "frontend/src/components/ExerciseListItem.tsx": "Displays a single exercise template with inline editing and deletion capabilities. Supports editing exercise name (backend limitation) with validation, and shows sets/comments in read-only mode during edit.",
  "frontend/src/components/ExercisePicker.tsx": "Dropdown selector for choosing exercises from a library with an 'Add' button. Displays exercise name and default set values (weight×reps) in the dropdown options.",
  "frontend/src/components/ExerciseTracker.tsx": "Collapsible card for tracking exercise completion during a workout session. Allows editing sets (weight/reps) and comments, with visual indicators for completion status and data entry.",
  "frontend/src/components/HistorySessionCard.tsx": "Clickable card displaying a completed workout session summary with date, name, and exercise count. Navigates to detailed session view on click.",
  "frontend/src/components/Layout.tsx": "Main app layout with sticky header, bottom navigation bar (Home, Library, New, History), and footer. Includes active route highlighting and Caffeine.ai attribution.",
  "frontend/src/components/SessionExerciseList.tsx": "Displays selected exercises for a workout session with reordering (up/down) and removal controls. Shows exercise name and default set values for each item.",
  "frontend/src/components/SetInputRow.tsx": "Simple input row component for entering weight and reps for a single set. Supports disabled state and numeric validation with min/step attributes.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the Internet Computer backend actor with authentication. Automatically invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including exercises (CRUD), workout sessions, and workout history with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme color schemes and typography settings using Inter font family.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/ActiveWorkout.tsx": "Manages active workout session page where users track exercises with sets/reps/weight, mark exercises complete, and save the entire workout to backend.",
  "frontend/src/pages/CreateSession.tsx": "Allows users to create a new workout session by naming it, selecting exercises from library, reordering them, then navigating to the active workout page with selected exercise IDs.",
  "frontend/src/pages/ExerciseLibrary.tsx": "Displays user's exercise template library with CRUD operations, showing templates with default set values that can be added via a dialog form.",
  "frontend/src/pages/Home.tsx": "Landing page component displaying welcome message and four navigation cards linking to Exercise Library, New Session, Workout History, and Progress pages with amber/orange gradient styling.",
  "frontend/src/pages/SessionDetail.tsx": "Displays detailed view of a single workout session including name, date, and completed exercises with sets/reps/weights using the CompletedExerciseDisplay component.",
  "frontend/src/pages/WorkoutHistory.tsx": "Lists all past workout sessions using HistorySessionCard components, showing loading state and empty state when no workouts exist.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, container settings, border radius variables, animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking Track-A-Swole workout app features including exercise library, workout sessions with 3-set structure, history viewing, and dark theme with amber/orange styling."
}