{
  "backend/main.mo": "Motoko actor defining workout tracking backend with exercise library management (add, edit, delete, list templates with sets/reps/comments) and workout session management (create sessions, add exercises, complete sessions, retrieve history).",
  "feature_evidence.json": "Feature evidence report documenting three localStorage persistence features in ActiveWorkout.tsx: persisting session state on data changes, restoring state on mount (prioritizing localStorage over URL params), and clearing localStorage after successful save.",
  "frontend-file-summaries.txt": "JSON object containing one-line summaries of all frontend files, describing components, pages, hooks, and configuration files with their key functionality and recent changes.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark theme variables, using amber/orange accent colors instead of typical blue/purple palette.",
  "frontend/index.html": "HTML entry point for the Track-A-Swole application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "TanStack Router setup defining application routes (home, exercises, create-session, workout with exerciseIds search param, history, session detail) with Layout wrapper.",
  "frontend/src/components/AddExerciseForm.tsx": "Form component for creating exercise templates with name input, three sets of weight/reps inputs, comments field, validation, and explicit onClick handler on submit button to ensure proper form submission.",
  "frontend/src/components/CompletedExerciseDisplay.tsx": "Read-only card component displaying completed exercise details in a table format with set number, weight, reps, and optional comments section.",
  "frontend/src/components/ExerciseListItem.tsx": "Displays an individual exercise template with inline editing and deletion capabilities. Supports editing exercise name (backend limitation) with validation, and includes an alert dialog for delete confirmation.",
  "frontend/src/components/ExercisePicker.tsx": "Dropdown selector component for choosing exercises from a library and adding them to a workout session. Displays exercise name and default set values in the dropdown options.",
  "frontend/src/components/ExerciseTracker.tsx": "Collapsible card component for tracking exercise performance during a workout session. Allows input of weight/reps for each set and comments, with visual indicators for data entry.",
  "frontend/src/components/HistorySessionCard.tsx": "Clickable card displaying a completed workout session summary with date, name, and exercise count. Navigates to detailed session view on click.",
  "frontend/src/components/Layout.tsx": "Main app layout with sticky header, bottom navigation bar, and footer. Provides navigation to Home, Library, New Session, and History pages with active state highlighting.",
  "frontend/src/components/SessionExerciseList.tsx": "Displays selected exercises for a workout session with reordering (up/down) and removal controls. Shows exercise name and default set values for each item.",
  "frontend/src/components/SetInputRow.tsx": "Simple input row component for entering weight and reps for a single set. Provides number inputs with validation and optional disabled state.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient configuration with support for delegation identity validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including exercises (CRUD), workout sessions (create, complete, add exercises), and history queries with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme color schemes, including primary amber/orange colors and chart color definitions.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/ActiveWorkout.tsx": "Manages active workout session state with localStorage persistence, allowing users to track exercises with sets/reps/weight and complete sessions with automatic restoration on page reload.",
  "frontend/src/pages/CreateSession.tsx": "Provides UI for creating new workout sessions with name input, exercise selection from library, reordering capabilities, and navigation to active workout with selected exercises.",
  "frontend/src/pages/ExerciseLibrary.tsx": "Displays user's exercise template library with add/edit capabilities through a dialog, showing all templates with their default set configurations.",
  "frontend/src/pages/Home.tsx": "Landing page component displaying welcome message and four navigation cards linking to Exercise Library, New Session, Workout History, and Progress pages with amber/orange gradient theming.",
  "frontend/src/pages/SessionDetail.tsx": "Displays details of a specific workout session including name, date, and list of completed exercises with their sets, fetched by session ID from route params.",
  "frontend/src/pages/WorkoutHistory.tsx": "Lists all past workout sessions using HistorySessionCard components, with loading states, error handling, and empty state messaging.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, container settings, border radius variables, custom animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata defining Track-A-Swole workout tracking app architecture, including exercise library with 3-set templates, workout session flow, history structure, and a known issue about session state loss on page refresh."
}