{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Implement session state persistence for active workout across page refreshes",
  "requirements": [
    {
      "id": "REQ-25",
      "summary": "Persist active workout session state to localStorage whenever data changes",
      "acceptanceCriteria": [
        "Session name is saved to localStorage on change",
        "Exercise IDs are saved to localStorage when loaded from URL params",
        "All set data (weight, reps, comments) for each exercise is saved to localStorage as it's entered or modified",
        "localStorage key uses a consistent naming convention (e.g., 'activeWorkoutSession')"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ActiveWorkout.tsx",
          "operation": "modify",
          "description": "Add localStorage persistence logic to save session state whenever session name, exercise data, or set data changes. Use a useEffect hook that watches session name and exercise state arrays, and persist to localStorage under the key 'activeWorkoutSession'. Store session name, exercise IDs array, and complete set data (weight, reps, comments) for each exercise. Ensure this saves after any user input change in the session name field or any ExerciseTracker component updates."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Restore persisted workout session state from localStorage on page mount",
      "acceptanceCriteria": [
        "On page load, check localStorage for saved session data",
        "If localStorage has saved session, restore session name, exercise list, and all set data",
        "If no localStorage data exists, fall back to loading exercises from URL params as currently implemented",
        "User can continue editing their workout exactly where they left off after refresh"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ActiveWorkout.tsx",
          "operation": "modify",
          "description": "Add initialization logic in a useEffect hook on component mount to check localStorage for 'activeWorkoutSession' data. If found, restore session name state, exercise IDs, and all set data for each exercise. If localStorage data exists, prioritize it over URL search params. If no localStorage data exists, maintain the current behavior of loading exercises from URL params. Ensure the restored state populates all form fields and ExerciseTracker components correctly so users can continue their workout seamlessly after a page refresh."
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Clear localStorage session data after successful workout save",
      "acceptanceCriteria": [
        "After successful completeSession mutation, remove the activeWorkoutSession data from localStorage",
        "After clearing localStorage, the active workout state is also cleared as currently implemented",
        "Starting a new workout session after completing one does not show data from the previous session"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ActiveWorkout.tsx",
          "operation": "modify",
          "description": "Add localStorage.removeItem('activeWorkoutSession') call in the success handler of the completeSession mutation (after the backend save succeeds but before navigation or state clearing). This ensures persisted session data is cleaned up after a successful save, preventing stale data from appearing in future workout sessions. Do not modify the existing completeSession mutation logic or the current session clearing behavior."
        }
      ]
    }
  ]
}